{
  "backend/main.mo": "Motoko canister defining user profiles, circles, rooms, posts, comments, connections, reflections, and challenges with access control and basic profile CRUD.",
  "feature_evidence.json": "Feature evidence report describing a change to the Home page welcome heading and listing related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in routing, UI pages, and components.",
  "frontend/index.css": "Tailwind CSS base file defining design tokens, light/dark theme variables, and global styling.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app setup handling authentication, profile loading, routing configuration, and conditional onboarding flow.",
  "frontend/src/components/nav/AppShell.tsx": "Layout component providing sidebar, bottom navigation, and user session/logout controls.",
  "frontend/src/components/zen/AvatarPicker.tsx": "Avatar selection grid allowing users to choose from a sprite sheet with visual selection state.",
  "frontend/src/components/zen/GlassCard.tsx": "Reusable glass-style card wrapper supporting hover effects and custom classes.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing the backend actor based on Internet Identity, including admin token initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using Dfinity AuthClient, including login state and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and circles via a backend actor.",
  "frontend/src/index.css": "Sets global Tailwind CSS styles, theme variables, dark mode tokens, and custom Zen UI effects.",
  "frontend/src/lib/localCirclesStore.ts": "Creates a persisted Zustand store for managing local demo circles, user-created circles, and membership actions.",
  "frontend/src/lib/localRoomsStore.ts": "Provides a persisted Zustand store for demo rooms and user-created rooms with retrieval and reset helpers.",
  "frontend/src/lib/localWallStore.ts": "Implements a persisted Zustand store for wall posts, comments, likes, pagination, and demo content.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatThread.tsx": "Renders a chat thread UI with voice‑first messaging and typed message input for a given user.",
  "frontend/src/pages/CircleDetail.tsx": "Displays details of a specific circle including members, prompts, and metadata using local circle state.",
  "frontend/src/pages/Circles.tsx": "UI for managing growth circles, allowing users to create, join, and view circles with invite code copy support. Integrates local store actions and modal dialogs for creation and joining.",
  "frontend/src/pages/Connections.tsx": "Displays connection suggestions, incoming requests, and existing connections with actions to send, accept, or decline requests. Uses tabs and cards for structured browsing of users.",
  "frontend/src/pages/Debate.tsx": "Shows a weekly debate topic, lets users post responses, and lists community replies with likes. Includes input validation and toast notifications.",
  "frontend/src/pages/Guidelines.tsx": "Renders community guidelines and prohibited behaviors using stylized cards and icons. Provides static informational content for user conduct.",
  "frontend/src/pages/Home.tsx": "Home dashboard showing user greeting, daily challenge, and quick navigation cards to major features. Pulls user profile and highlights weekly content.",
  "frontend/src/pages/Landing.tsx": "Public landing page with hero section, branding, differentiators, and login button via Internet Identity. Introduces the platform's purpose and value proposition.",
  "frontend/src/pages/MBTI.tsx": "Implements an MBTI quiz with multiple questions, state tracking, and progression through the test.",
  "frontend/src/pages/Moderation.tsx": "Displays a static admin-only moderation page with restricted-access messaging.",
  "frontend/src/pages/Onboarding/OnboardingFlow.tsx": "Handles a multi-step onboarding flow collecting username, avatar, interests, goals, bio, and MBTI preferences, then saves the profile.",
  "frontend/src/pages/Profile.tsx": "Shows the user's anonymous profile with avatar, bio, interests, goals, MBTI status, and logout functionality.",
  "frontend/src/pages/Progress.tsx": "Renders a progress dashboard with stats, growth indicators, and recent reflections.",
  "frontend/src/pages/RoomDetail.tsx": "Displays details for a voice-only room including metadata, participants, and a push-to-talk interface.",
  "frontend/src/pages/Rooms.tsx": "Renders the Voice Rooms page with a room creation dialog and a grid of locally stored rooms navigable by ID.",
  "frontend/src/pages/Wall.tsx": "Implements an anonymous posting wall with categories, comments, likes, and load-more functionality using local store state.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read, store, persist, and clear URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and container settings for the Zenlink theme.",
  "project_state.json": "Describes the Zenlink project state, goals, architecture, features, and known build issues."
}